Autodesk.Revit.DB.DirectContext3D.Camera.Transform(Autodesk.Revit.DB.Transform)
Transforms the camera
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2017

Autodesk.Revit.DB.DirectContext3D.Camera.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.DirectContext3D.Camera.FarDistance
Distance to far clipping plane
Since:
2017

Autodesk.Revit.DB.DirectContext3D.Camera.NearDistance
Distance to near clipping plane
Since:
2017

Autodesk.Revit.DB.DirectContext3D.Camera.VerticalOffset
Vertical offset of the camera's view center from target, measured at target distance.
Since:
2017

Autodesk.Revit.DB.DirectContext3D.Camera.VerticalExtent
Vertical extent of the camera's view, measured at target distance.
Since:
2017

Autodesk.Revit.DB.DirectContext3D.Camera.HorizontalOffset
Horizontal offset of the camera's view center from target, measured at target distance.
Since:
2017

Autodesk.Revit.DB.DirectContext3D.Camera.HorizontalExtent
Horizontal extent of the camera's view, measured at target distance.
Since:
2017

Autodesk.Revit.DB.DirectContext3D.Camera.TargetDistance
Distance from camera to its target
Since:
2017

Autodesk.Revit.DB.DirectContext3D.Camera.ProjectionMethod
Projection method
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2017

Autodesk.Revit.DB.DirectContext3D.Camera.UpDirection
Up direction of the camera
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2017

Autodesk.Revit.DB.DirectContext3D.Camera.ViewDirection
Direction that the camera is facing
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2017

Autodesk.Revit.DB.DirectContext3D.Camera.EyePosition
Camera's position in the world
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2017

Autodesk.Revit.DB.DirectContext3D.Camera.#ctor(Autodesk.Revit.DB.DirectContext3D.Camera)
Camera
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2017

Autodesk.Revit.DB.DirectContext3D.Camera
A collection of camera settings for the current view.
Remarks:
The current Camera can be obtained from Autodesk.Revit.DB.DirectContext3D.DrawContext
Since:
2017